import { Section, Heading, ListItem } from './AboutMe.Styled';


const AboutMe = () => {

  const listHistory = [
    '> Привіт, я — Сандра',
    'фітнес-тренер, нутріціолог і авторка техніки роботи з тілом через дихання.',
    '10+ років практики, сотні клієнтів та знань, які я хочу дати тобі',
    'Я не обіцяю, що буде легко.',
    'Але обіцяю — буде по-справжньому.',
    'Мене звати Сандра. Я не про “качай прес” — я про:',
    'розслаб живіт — і відчуй силу',
    'Я створила цей курс не для того, щоб ти “була правильна”. А щоб ти стала включена, глибока, дика і дуже жива.',
    '21 день — і ти забудеш, як це: бути скутою.',
    '10 тренувань, які прокачають не тіло, а стан.',
    '21 подкаст, які увімкнуть нове мислення.',
    '> Дихай глибше, жінко. Справжнє тільки починається.',
    'Я — фітнес-тренер, нутріціолог і авторка методу «тілесного пробудження» через дихання, рух і стиль. За 10+ років роботи з тілом я побачила:',
    '💔 стиснуте дихання = стиснуте життя.',
    'А потім знайшла ключ: усвідомлене дихання → включене тіло → справжня ти.',
    'Я створила цей курс, бо хочу, щоб кожна жінка:',
    'перестала виживати і навчилась жити з тілом заодно,',
    'дихала вільно, без паніки, болю й напруги,',
    'носила себе з гордістю — і тілом, і енергією, і голосом.',
    '> Коли ти в тілі — ти непереможна.',
    'І я хочу, щоб ти це відчула.',
  ];

  return (
    <Section>
      <Heading>{listHistory[0]}</Heading>
      {listHistory.slice(1).map((item, index) => (
        <ListItem key={index}>{ item}</ListItem>
      ))}
    </Section>
  )
};

export default AboutMe;